---
kind: type
id: T:Autodesk.Revit.DB.ImageResolution
source: html/a092ac09-7ca2-a928-94e5-27243284e423.htm
---
# Autodesk.Revit.DB.ImageResolution

This enum is used to define image resolution in order to calculate the image size.

## Syntax (C#)
```csharp
public enum ImageResolution
```

## Remarks
This is used only if the Zoom option for ZoomType is set.